In [2]:
import numpy as np
import pandas as pd

In [3]:
my_list=[10,20,30]
labels=['a','b','c']

In [4]:
arr=np.array([10,20,30])

In [5]:
d={'a':10,'b':20,'c':30}

In [38]:
pd.Series(data=my_list)    #by default the index of the series is numeric and starts with 0

0    10
1    20
2    30
dtype: int64

In [37]:
pd.Series(data=my_list,index=labels)   #giving index as lables instead of numbers

a    10
b    20
c    30
dtype: int64

In [8]:
np.array(my_list)

array([10, 20, 30])

In [9]:
df=pd.DataFrame(np.random.rand(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z']) #creating a Data Frame

In [10]:
df

          W         X         Y         Z
A  0.551390  0.945837  0.745543  0.533332
B  0.420535  0.575303  0.251811  0.355037
C  0.702279  0.468580  0.246358  0.236207
D  0.232082  0.883090  0.974427  0.646220
E  0.798286  0.464439  0.040461  0.512626

In [11]:
df['W']

A    0.551390
B    0.420535
C    0.702279
D    0.232082
E    0.798286
Name: W, dtype: float64

In [12]:
df[['W','X']]                   #For Accessing the Data Frame with 2 or more colomns we have to use double square brackets.

          W         X
A  0.551390  0.945837
B  0.420535  0.575303
C  0.702279  0.468580
D  0.232082  0.883090
E  0.798286  0.464439

In [13]:
df['new'] = df['W'] + df['X']

In [14]:
df

          W         X         Y         Z       new
A  0.551390  0.945837  0.745543  0.533332  1.497227
B  0.420535  0.575303  0.251811  0.355037  0.995838
C  0.702279  0.468580  0.246358  0.236207  1.170859
D  0.232082  0.883090  0.974427  0.646220  1.115172
E  0.798286  0.464439  0.040461  0.512626  1.262725

In [15]:
df.drop('new',axis=1,inplace=True)

In [16]:
df

          W         X         Y         Z
A  0.551390  0.945837  0.745543  0.533332
B  0.420535  0.575303  0.251811  0.355037
C  0.702279  0.468580  0.246358  0.236207
D  0.232082  0.883090  0.974427  0.646220
E  0.798286  0.464439  0.040461  0.512626

In [17]:
df

          W         X         Y         Z
A  0.551390  0.945837  0.745543  0.533332
B  0.420535  0.575303  0.251811  0.355037
C  0.702279  0.468580  0.246358  0.236207
D  0.232082  0.883090  0.974427  0.646220
E  0.798286  0.464439  0.040461  0.512626

In [18]:
df.loc[['A','B','C'],['X','Y']]

          X         Y
A  0.945837  0.745543
B  0.575303  0.251811
C  0.468580  0.246358

In [19]:
df.loc[['A','B']]

          W         X         Y         Z
A  0.551390  0.945837  0.745543  0.533332
B  0.420535  0.575303  0.251811  0.355037

In [20]:
df.loc[['A','B'],['W','X']]

          W         X
A  0.551390  0.945837
B  0.420535  0.575303

In [21]:
df.iloc[2]                #if we want to access the row by its numerical index, We have to use the iloc(ILOCATION) method

W    0.702279
X    0.468580
Y    0.246358
Z    0.236207
Name: C, dtype: float64

In [22]:
df

          W         X         Y         Z
A  0.551390  0.945837  0.745543  0.533332
B  0.420535  0.575303  0.251811  0.355037
C  0.702279  0.468580  0.246358  0.236207
D  0.232082  0.883090  0.974427  0.646220
E  0.798286  0.464439  0.040461  0.512626

In [23]:
df[df>0.5]             #we can use diff. condions, here it will give values of df greater than 0.5 and NaN is NOT A NUMBER

          W         X         Y         Z
A  0.551390  0.945837  0.745543  0.533332
B       NaN  0.575303       NaN       NaN
C  0.702279       NaN       NaN       NaN
D       NaN  0.883090  0.974427  0.646220
E  0.798286       NaN       NaN  0.512626

In [24]:
df[df<0.5]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B  0.420535       NaN  0.251811  0.355037
C       NaN  0.468580  0.246358  0.236207
D  0.232082       NaN       NaN       NaN
E       NaN  0.464439  0.040461       NaN

In [25]:
df=pd.DataFrame({'A' :[1,2,np.nan],
                 'B' :[5,np.nan,np.nan],
                 'C' :[1,2,3]})

In [26]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [33]:
df.fillna(value='FILLVALUE')       #if we want to fill the NaN value with any string value use this method

           A          B  C
0          1          5  1
1          2  FILLVALUE  2
2  FILLVALUE  FILLVALUE  3

In [35]:
df['A'].fillna(value=df['A'].mean())        #filling the NaN values by using MEAN method. (it will calculate the mean of value
                                            # of the given column and fill it in NaN values in that column)

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [36]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3